# Завдання 1

# Написати програму, яка переміщає всі нулі у кінець списку.

# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.

# Порядок ненульових чисел має зберегтися!

# Приклад:

# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

# Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.

########################

def is_zero(e):
    return e == 0

main_list = [
    [0, 1, 0, 12, 3],
    [0],
    [1, 0, 13, 0, 0, 0, 5],
    [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
]

for list in main_list:
    modify_list = list.copy()
    modify_list.sort(reverse=False, key=is_zero)
    print(f"{list} -> {modify_list}")


